Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Determines whether an array includes a certain value among its entries, returning true or false as appropriate.
zh_cn: 确定数组的条目中是否包含某个值，并根据需要返回true或false。

source: Determines whether an array includes certain values among its entries, returning true or false as appropriate.
zh_cn: 确定数组的条目中是否包含某些值，根据需要返回true或false。

source: Dialog event
zh_cn: 对话事件

source: Direction is one of those properties and can be used to set the direction of movement of the instance when the instance has a speed other than 0.
zh_cn: Direction是其中一个属性，可以用来设置实例的移动方向，当实例的速度不是0时。

source: Directories
zh_cn: 目录

source: Disables the "reliable UDP" protocol for an existing UDP socked.
zh_cn: 为现有的UDP sock禁用"可靠的UDP"协议。

source: Distorts sound by reducing bandwidth.
zh_cn: 通过降低带宽使声音失真。

source: Doesn't account for order.
zh_cn: 并不能解释顺序。

source: Dots per inch (DPI) is a measure of spatial printing or video dot density, in particular the number of individual dots that can be placed in a line within the span of 1 inch (2.54 cm).
zh_cn: 每英寸点位(DPI)是空间打印或视频点位密度的度量，特别是在1英寸(2.54厘米)的跨度内可以放置在一条直线上的单个点位的数量。

source: Draw event.
zh_cn: 绘制事件.

source: EG: sqr(5) would return 25 since 5*5=25.
zh_cn: 例如:sqr(5)将返回25，因为5*5=25。

source: Each component of the colours is stored as a floating point value between 0 and 1, and the new colour is calculated by multiply each component of the source colour by some factor and by multiplying each component of destination colour by some other factor and then adding the results together component by component.
zh_cn: 颜色的每个组成部分都存储为0到1之间的浮点值，新颜色的计算方法是:将源颜色的每个组成部分乘以某个乘数，将目标颜色的每个组成部分乘以其他乘数，然后将结果逐项相加。

source: Each hat value is a bit-mask for the different directions where:
zh_cn: 每个hat值是不同方向的位掩码，其中:

source: Either true to set release mode or false for general development.
zh_cn: 设置发布模式为true，设置一般开发为false。

source: Either way, this function will help you to find and resolve the problem by drawing what is going on in your physics system.
zh_cn: 无论哪种方式，此函数将通过绘制物理系统中正在发生的事情来帮助你找到并解决问题。

source: Elastic particles deform and may also bounce when they collide with other rigid bodies in the physics simulation.
zh_cn: 在物理模拟中，弹性粒子在与其他刚体碰撞时会变形，也可能会反弹。

source: Enable (set to true) or disable (false) audio debugging.
zh_cn: 启用(设置为true)或禁用(false)音频调试。

source: Enable (set to true) or disable (set to false) tap counting.
zh_cn: 启用(设置为true)或禁用(设置为false)点击计数。

source: Enable (true) or disable (false) AA for all SWF sprites.
zh_cn: 为所有 SWF 精灵启用 (true) 或禁用 (false) AA。

source: Enable (true) or disable (false) this function.
zh_cn: 启用(true)或禁用(false)此函数。

source: Enable or disable all lighting (true or false)
zh_cn: 启用或禁用所有照明 (true or false)

source: Enable or disable alpha blending value (true or false).
zh_cn: 启用或禁用alpha混合值(true或false)。

source: Enable or disable alpha testing (true / false)
zh_cn: 启用或禁用alpha测试(true / false)

source: Enable or disable angle limiting for the joint.
zh_cn: 启用或禁用关节的角度限制。

source: Enable or disable fog
zh_cn: 启用或禁用雾

source: Enable or disable texture filtering (true / false)
zh_cn: 启用或禁用纹理过滤(true / false)

source: Enable or disable the texture debug messages
zh_cn: 启用或禁用纹理调试消息

source: Enable or disable z-buffer testing (true or false).
zh_cn: 启用或禁用z-buffer测试(true或false)。

source: Enable/disable the alpha channel
zh_cn: 启用/禁用alpha通道

source: Enable/disable the blue channel
zh_cn: 启用/禁用蓝色通道

source: Enable/disable the green channel
zh_cn: 启用/禁用绿色通道

source: Enable/disable the red channel
zh_cn: 启用/禁用红色通道

source: Enabled
zh_cn: 启用

source: Enables the "reliable UDP" protocol for an existing UDP socket
zh_cn: 为现有的UDP套接字启用"可靠的UDP"协议

source: End Step
zh_cn: 步结束 End Step

source: End the path
zh_cn: 结束路径

source: Epsilon is a value used to determine whether two numbers subject to rounding error are close enough to be considered "equal".
zh_cn: Epsilon是一个值，用来确定两个有舍入误差的数字是否足够接近，被认为是"相等"的。

source: Essentially, by default when z-testing is off and you have two objects drawing to the same space, both objects will be rendered regardless of whether one will over-draw the other, resulting in unnecessary draw calls.
zh_cn: 本质上，默认情况下，当z-testing关闭，并且你有两个对象绘制到相同的空间时，两个对象都会被渲染，而不管一个对象是否会过度绘制另一个对象，这会导致不必要的绘制调用。

source: Even if a cell partially falls within the defined rectangular region it will be cleared.
zh_cn: 即使单元格部分落入定义的矩形区域，它也会被清除。

source: Even if you have defined the physics for your objects, without a world to place them in they will default to the traditional GameMaker collision system, so you need this function to create the physics system for the specified room either in an object event, or the creation code of the room itself (it can also be defined without using code in the room editor).
zh_cn: 即使你已经为你的对象定义了物理系统，如果没有一个世界来放置它们，它们将默认为传统的GameMaker碰撞系统，所以你需要此函数来为指定的房间创建物理系统，或者在一个对象事件中，或者在房间本身的创建代码中(它也可以在不使用房间编辑器中的代码的情况下被定义)。

source: Even when a sprite has a precise collision mask, the bounding box exists and is used for certain things, and so you can use this variable to find it.
zh_cn: 即使精灵有一个精确的碰撞掩码，边界框仍然存在，并用于某些事情，所以你可以使用这个变量来找到它。

source: Every instance that you create - whether through code or by adding them to a room in the Room Editor - is given a number that is used internally to identify this instance and the variable id is what you can use to reference it.
zh_cn: 您创建的每个实例——无论是通过代码还是通过在room Editor中将它们添加到房间中——都有一个编号，用于在内部标识该实例，变量id是您可以用来引用它的。

source: Everything in GameMaker is based around steps and, normally, each event will only happen once per step.
zh_cn: GameMaker中的一切都是基于步骤的，通常情况下，每个事件在每个步骤中只会发生一次。

source: Extra configuration parameter.
zh_cn: 额外的配置参数。

source: Failure to do so can cause memory leaks which will eventually slow down and crash your game.
zh_cn: 如果做不到这一点，就会导致内存泄漏，最终导致游戏速度变慢并崩溃。

source: Finally you call this function, which will start the saving of the files.
zh_cn: 最后调用此函数，它将开始保存文件。

source: Finally you can assign a priority, which is then used to determine how sounds are dealt with when the number of sounds playing is over the limit set by the function audio_channel_num().
zh_cn: 最后，您可以分配一个优先级，然后使用它来确定当播放的声音数量超过函数audio_channel_num()设置的限制时如何处理声音。

source: Finally you give an object index or an instance ID to use as the object that is going to override the sequence (supplying an instance ID will simply use the object that the instance was created from as the override).
zh_cn: 最后，您提供一个对象索引或一个实例ID，用作将要覆盖序列的对象(提供实例ID将简单地使用创建实例的对象作为覆盖)。

source: Finally you give the buffer index to copy the vertex data into, as well as a data offset to define the position to copy the vertex data to in the destination buffer.
zh_cn: 最后，给出顶点数据复制到的缓冲区索引，以及定义顶点数据在目标缓冲区中的复制位置的数据偏移量。

source: Finally you must give the number arguments that the function can take (from 0 to 15) and for each of the arguments you must specify its type too.
zh_cn: 最后，您必须给出函数可以接受的参数数量(从0到15)，对于每个参数，您还必须指定其类型。

source: Finally you need to call physics_particle_group_end() to create the group of particles in the room.
zh_cn: 最后，您需要调用physics_particle_group_end()来创建房间中的粒子组。

source: Finally you need to specify the length of the array (or the length of the part that you want) to copy.
zh_cn: 最后，您需要指定要复制的数组的长度(或者您想要的部分的长度)。

source: Finally, if a persisted system moves to a room with a layer at the same depth as the layer the system was created on, it will not be assigned to this layer, but instead a new layer will be created at the same depth (with the same name as the original layer).
zh_cn: 最后，如果一个持久的系统移动到一个具有与创建系统的层相同深度的层的房间，它将不会被分配到这个层，而是在相同深度(具有与原始层相同的名称)创建一个新层。

source: Finally, the x and y position is the position within the room that the sprite will be drawn, and it is centered on the sprite x offset and y offset.
zh_cn: 最后，x 和 y 位置是房间内精灵将被绘制的位置，它以精灵 x 偏移和 y 偏移为中心。

source: Finishing x coordinate of the new path
zh_cn: 完成新路径的x坐标

source: Finishing y coordinate of the new path
zh_cn: 完成新路径的y坐标

source: Fired when connection attempt was rejected.
zh_cn: 连接尝试被拒绝时触发。

source: Fired when server wants clients to stop the game.
zh_cn: 当服务器希望客户端停止游戏时触发。

source: Fired when the (in rollback_event_param) player_id is connected
zh_cn: 当(在rollback_event_param中)player_id被连接时触发

source: Fired when the (in rollback_event_param) player_id is disconnected
zh_cn: 当(在rollback_event_param中)player_id断开连接时触发

source: Fired when the (in rollback_event_param) player_id is done synchonizing
zh_cn: 当(在rollback_event_param中)player_id完成同步时触发

source: Fired when the (in rollback_event_param) player_id is synchonizing
zh_cn: 当(在rollback_event_param中)player_id正在同步时触发

source: Fired when the game is interrupted by a (in rollback_event_param) player_id
zh_cn: 当游戏被(在rollback_event_param中)player_id中断时触发

source: Fired when the game resumes after being interrupted by (in rollback_event_param) player_id
zh_cn: 当游戏被(在rollback_event_param中)player_id中断后恢复时触发

source: Fired when the game you're trying to join is already full
zh_cn: 当你尝试加入的游戏已经满员时触发

source: Fired when the latency to the server is too high and it's impossible to run the game.
zh_cn: 当服务器的延迟太高，无法运行游戏时触发。

source: Fired when you fail to connect to the backend
zh_cn: 当您无法连接到后端时触发

source: Fired when you get info of where players should connect (in rollback_event_param) share_url
zh_cn: 当你获得玩家应该连接到哪里的信息时触发(在rollback_event_param中)

source: Fired when you receive a chat message, including those sent by the local player (in rollback_event_param) message, from and to
zh_cn: 当您收到聊天消息，包括本地玩家发来的消息(在rollback_event_param消息中)时触发

source: Fired when you receive back info about the game (in rollback_event_param) player_id and num_players
zh_cn: 当您收到关于游戏的返回信息(在rollback_event_param中)player_id和num_players时触发

source: Fired when you receive new preferences set by any of the players in the game, including those set by the local player (in rollback_event_param) preferences, and player_id
zh_cn: 当您收到游戏中任何玩家设置的新首选项时触发，包括由本地玩家(在rollback_event_param首选项中)和player_id设置的首选项

source: Flag for if the filter or effect should be forced on a single layer.
zh_cn: 是否应在单个图层上强制应用滤镜或效果的标志。

source: Flag the particle system as persistent (set to true) or not (set to false)
zh_cn: 将粒子系统标记为持久化(设置为true)或非持久化(设置为false)

source: Flag to enable default display of events
zh_cn: 启用事件默认显示的标志

source: Flag to enable random input for other players in sync test
zh_cn: 在同步测试中为其他玩家启用随机输入的标志

source: Flag to enable sync test for development (optional, default is true)
zh_cn: 启用开发同步测试的标志(可选，默认为真)

source: Flag to only check if you should join without actually doing it
zh_cn: 标志来检查您是否应该加入，而不是实际加入

source: Flags the sound as looping or not.
zh_cn: 将声音标记为循环或不循环。

source: Fog can be used in 3D games to make instances in the distance look blurred or even disappear, which helps in creating atmosphere as well as masking the fact that you are not drawing instances that are far away.
zh_cn: 雾可以在3D游戏中使用，使远处的实例看起来模糊甚至消失，这有助于创造气氛，并掩盖你没有绘制远处实例的事实。

source: For Google Analytics, you can only add in one extra pair while Flurry will accept up to 7.
zh_cn: 对于谷歌Analytics，你只能额外添加一对，而Flurry可以接受多达7对。

source: For Nintendo Switch Target only.
zh_cn: 仅适用于任天堂Switch目标。

source: For a full list of constants that are available for the specific sub-events see event_perform(), and if you should need to know the main event itself, you should be checking the event_type.
zh_cn: 有关特定子事件可用的常量的完整列表，请参见event_perform()，如果您需要知道主事件本身，您应该检查event_type。

source: For a polygon shape, the points are relative to the origin of the fixture, with the 0,0 position of the x/y axis being the centre, and the subsequent coordinates being calculated as usual in GameMaker with down/right being +x,+y and up/left being -x,-y.
zh_cn: 对于多边形形状，这些点相对于夹具的原点，x/y 轴的 0,0 位置为中心，随后的坐标在 GameMaker 中照常计算，下/右为 +x,+y 和 上/左为 -x,-y。

source: For each contact point there is an associated contact normal (which is usually the same normal for all points of contact in the collision).
zh_cn: 对于每个接触点都有一个相关的接触法线(对于碰撞中的所有接触点通常是相同的法线)。

source: For example - sign(458) will return 1, sign(-5) will return -1 and sign(0) will return 0.
zh_cn: 例如 - sign(458)将返回1，sign(-5)将返回-1，sign(0)将返回0。

source: For example if you have a minimum of 3 and a maximum of 6, all particles will be created with a speed between three and six pixels per step.
zh_cn: 例如，如果最小值为3，最大值为6，所有粒子将以每步3到6个像素的速度创建。

source: For example many people use the keys WASD for movement, but then many people also use the arrow keys!
zh_cn: 例如，许多人使用WASD键进行移动，但也有许多人使用方向键!

source: For example max(12, 96, 32, 75) will return 96 as that is the highest of all the input values.
zh_cn: 例如，max(12,96,32,75)将返回96，因为这是所有输入值中最高的。

source: For example min(12, 96, 32, 75) will return 12 as that is the lowest of all the input values.
zh_cn: 例如min(12,96,32,75)将返回12，因为它是所有输入值中最小的。

source: For example the filename path "Data\Player_Save.sav" would actually be saved to "default\Data\Player_Save.sav".
zh_cn: 例如，文件名路径"Data\Player_Save.sav"实际上会保存为"default\Data\Player_Save.sav"。

source: For example you can use the variable room to get the index of the current room and then use this function to find the room that comes before it, as listed in the Room Manager.
zh_cn: 例如，您可以使用变量room来获取当前房间的索引，然后使用此函数来查找它之前的房间，如房间管理器中所列。

source: For example you can use the variable room to get the index of the current room and then use this function to find the room that follows it, as listed in the Room Manager.
zh_cn: 例如，您可以使用变量room来获取当前房间的索引，然后使用此函数来查找紧随其后的房间，如房间管理器中所列。

source: For example, 0 will return col1, 1 will return col2, and 0.5 would return a merge of both colours equally
zh_cn: 例如，0将返回列1，1将返回列2，而0.5将返回两种颜色相等的合并

source: For example, a smoke trail would have additive blending off to keep the effect gray, but a flame effect would probably have it on to make the particles more translucent and brighter.
zh_cn: 例如，烟雾痕迹将添加混合以保持效果的灰色，但火焰效果可能会添加它以使粒子更加半透明和明亮。

source: For example, a value of 0.5 will mix the two colours equally.
zh_cn: 例如，值为0.5会将两种颜色均匀混合。

source: For example, degtorad(180) returns 3.14159265 radians.
zh_cn: 例如，degtorad(180)得出3.14159265弧度。

source: For example, if the base width for a line break is 300 and you set the scale to 2, then the text will appear wrong, over-running the given width.
zh_cn: 例如，如果换行符的基本宽度是300，而您将缩放比例设置为2，那么文本将显示错误，超出给定的宽度。

source: For example, if the layer is an Asset Layer, the array will be populated with the ID values for each sprite asset that is assigned to the layer.
zh_cn: 例如，如果该层是一个资源层，数组将填充分配给该层的每个精灵资源的ID值。

source: For example, if you are running it on Windows 10, os_version will be equal to 655360.
zh_cn: 例如，如果在Windows 10上运行它，那么os_version将等于655360。

source: For example, if you have a "walk" animation and its keyframes only affect the legs of the sprite, you can then have a set of head animations and arm animations which you can set in tracks 1 and 2 respectively, permitting you to have a base movement and adapt on it in real-time while the game is being played.
zh_cn: 例如，如果您有一个"行走"动画，并且其关键帧只影响精灵的腿，那么您可以有一组头部动画和手臂动画，可以分别在轨迹1和轨迹2中设置，允许您在玩游戏时有一个基本移动并实时适应它。

source: For example, if you have a 200 x 150 pixel window, and the player stretches the window by dragging the borders, the final window size may be 400 x 300 pixels, but the drawing canvas is STILL 200 x 150, which gives a blurred image as the pixel ratio is now 1:2.
zh_cn: 例如，如果您有一个200 x 150像素的窗口，并且播放器通过拖动边框来拉伸该窗口，则最终的窗口大小可能是400 x 300像素，但是绘图画布仍然是200 x 150，这给出了一个模糊的图像，因为像素比现在是1:2。

source: For example, if you have the particle number set to -5, there is a 1:5 chance that a particle will be produced every step.
zh_cn: 例如，如果将粒子数设置为-5，则每一步产生一个粒子的可能性为1:5。

source: For example, if you wish to change the bounding box for a sprite, or set its alpha from another sprite, you must first duplicate it, then perform the operation on the duplicated sprite and use that.
zh_cn: 例如，如果您希望更改某个精灵的边界框，或者从另一个精灵设置其alpha，您必须首先复制它，然后在复制的精灵上执行操作并使用它。

source: For example, if your buffer alignment is set to 4 bytes and you write a single piece of data which is 1 byte in size then do a buffer_tell(), you'll get an return value of 1.
zh_cn: 例如，如果您的缓冲区对齐设置为4字节，并且您写入了1字节大小的单个数据，然后执行buffer_tell()，您将得到返回值1。

source: For example, if your sprite is for a platform game, then you may have a "jump" set, a "run" set and an "idle" set all contained within the one sprite and you can switch between them in your game using this function.
zh_cn: 例如，如果你的精灵是面向平台游戏，那么你就可以在一个精灵中设置"跳跃"设置、"奔跑"设置和"空闲"设置，你可以使用此函数在游戏中切换它们。

source: For example, in the image below if we want to get the direction from the player ship position to the enemy position so that we can fire a missile at the enemy then we would use this function (the exact code is in the example below the image):
zh_cn: 例如，在下图中，如果我们想获得从玩家船位置到敌人位置的方向，以便我们可以向敌人发射导弹，那么我们将使用此函数(确切的代码在下图的示例中):

source: For example, in the image below if we want to get the distance between the player ship position and the enemy position so that we can calculate if the enemy is close enough to shoot at then we would use this function (the exact code is in the example below the image):
zh_cn: 例如，在下图中，如果我们想获得玩家船位置和敌人位置之间的距离，这样我们就可以计算敌人是否足够近可以射击，那么我们可以使用此函数(确切的代码在下图的例子中):

source: For example, irandom_range(10, 35) will return an integer between 10 and 35 inclusive.
zh_cn: 例如，irandom_range(10，35)将返回一个介于10和35之间的整数。

source: For example, it's possible that (5 / 3) * 3 will not be equal to 5!
zh_cn: 例如，(5 / 3) * 3 可能不等于5!

source: For example, logn(5,25) will return how many 5's we need to multiply to get 25 (which is 2).
zh_cn: 例如，logn(5,25)将返回需要乘多少个5才能得到25(等于2)。

source: For example, on a path with only two points, 0 and 1, where the point 0 speed factor is 100 and point 1 speed factor is 0, the function path_get_speed(path, 0.5) will return 50.
zh_cn: 例如，在只有两个点0和1的路径上，其中点0的速度乘数为100，点1的速度乘数为0，函数path_get_speed(path, 0.5)将返回50。

source: For example, power(5,3) will multiply 5 by itself 3 times and return 125, which is the same as saying 5*5*5=125.
zh_cn: 例如，幂(5,3)将5乘以自身3倍，返回125，这与5*5*5=125相同。

source: For example, radtodeg(sin(180)) will return -45 degrees.
zh_cn: 例如，radtodeg(sin(180))将返回-45度。

source: For example, random(100) will return a value from 0 to 99, but that value can be 22.56473!
zh_cn: 例如，random(100)将返回一个从0到99的值，但该值可以是22.56473!

source: For example, random_range(20,50) will return a random number from 20 to 50, but the value may be a real number like 38.65265.
zh_cn: 例如，random_range(20,50)将返回一个从20到50的随机数，但该值可能是一个实数，如38.65265。

source: For example, say you have a procedurally generated game, but want the player to be able to go back to previously discovered areas.
zh_cn: 例如，假设你有一款程序生成游戏，但希望玩家能够回到之前发现的区域。

source: For example, say you have this text - "I am 81 years old".
zh_cn: 比如说你有这条文本 - "I am 81 years old"。

source: For example, say you want to create an object with a random sprite at the start, then you could use this function to set the sprite index to one of a set of given sprites.
zh_cn: 例如，假设你想在开始时创建一个带有随机精灵的对象，那么你就可以使用此函数将精灵索引设置为一组给定的精灵中的一个。

source: For example, say your player is on a layer that is at a lower depth than another layer and you want it to appear behind the layers between the two.
zh_cn: 例如，假设你的玩家所在的层比另一层的深度低，你想让它出现在两层之间的层的后面。

source: For example, this function can be used in conjunction with random_get_seed() to create procedurally generated content and save the results without having huge savegames (you save the seed only, no need for anything else).
zh_cn: 例如，此函数可以与random_get_seed()结合使用，以创建程序化生成的内容并保存结果，而不需要庞大的savegames(您只保存种子，不需要任何其他东西)。

source: For example, we may have added a value to the image index of a sprite and expect the result to be a single integer, but due to the nature of floating point maths, the actual final value ends up being something like 5.0000002, so when we have the following check:
zh_cn: 例如，我们可能在精灵的图像索引中添加了一个值，并期望得到的结果是一个整数，但由于浮点数学的本质，实际的最终值最终是5.0000002，所以当我们进行以下检查时:

source: For example, you can use this function to create alpha-channel only surfaces (switch off the RGB writing before using the surface), or to create special effects while drawing to the screen.
zh_cn: 例如，你可以使用此函数创建alpha通道表面(在使用表面之前关闭RGB写入)，或者在绘制到屏幕上时创建特殊效果。

source: For example, you may have a font asset called "fnt_Main" in the GameMaker Asset Browser, and the font itself may be the Windows system font Arial.
zh_cn: 例如，你可能在GameMaker资源浏览器中有一个名为"fnt_Main"的字体资源，字体本身可能是Windows系统字体Arial。

source: For example, you may have a generic walk animation and this can be used by your NPC characters, enemies, etc... in a game simply by changing the skin it is drawn with.
zh_cn: 例如，你可能有一个普通的行走动画，这可以被你的NPC角色，敌人等使用...在游戏中，只需改变绘制它的皮肤。

source: For example, you may have two displays with the same resolution of 400 x 800, but display 1 has a dpi of 60 and display 2 has a dpi of 30.
zh_cn: 例如，您可能有两个分辨率为400 x 800的显示器，但显示器1的dpi为60，显示器2的dpi为30。

source: For example:
zh_cn: 例如:

source: For example: "bitmaps|*.bmp;*.wmf", would ask the user to select the name of a bitmap file from the system, but only those that have the two specified extensions (bmp and png).
zh_cn: 比如:"bitmaps|*.bmp;*.wmf"时，会要求用户从系统中选择位图文件的名称，但只能是那些具有两个指定扩展名(bmp和png)的文件。

source: For example: sqrt(9) will return 3 since 3*3=9.
zh_cn: 例如:sqrt(9)将返回3，因为3*3=9。

source: For further information on global tile map bit masks, see the function tilemap_set_global_mask().
zh_cn: 有关全局tile map位掩码的更多信息，请参见函数tilemap_set_global_mask()。

source: For further information on tile map bit masks, see the function tilemap_set_mask().
zh_cn: 有关切片tile位掩码的更多信息，请参见函数tilemap_set_mask()。

source: For it to trigger again the button must first be pressed and then released once more. If you are checking an analogue button, then the check will take into consideration the threshold setting and only return true when the raw input value goes under the given threshold (you can get this raw value using the function gamepad_button_value()).
zh_cn: 为了再次触发它，必须先按下按钮，然后再释放一次。如果您正在检查一个模拟按钮，那么检查将考虑阈值设置，只有当原始输入值低于给定的阈值时才返回true(您可以使用函数gamepad_button_value()获得这个原始值)。

source: For it to trigger again the button must first be released and then re-pressed.
zh_cn: 要想再次触发，必须先松开按钮，然后再按下。

source: For more info, read the page on game_save().
zh_cn: 欲了解更多信息，请阅读game_save()页面。

source: For more information about scripts, see The Script Editor.
zh_cn: 有关脚本的更多信息，请参见脚本编辑器。

source: For more information on alpha testing, see the function gpu_set_alphatestref().
zh_cn: 有关alpha测试的更多信息，请参见函数gpu_set_alphatestref()。

source: For more information on configurations please see the section Configurations.
zh_cn: 有关配置的更多信息，请参阅配置部分。

source: For more information on display timing, please see display_set_timing_method().
zh_cn: 有关显示时序的更多信息，请参见display_set_timing_method()。

source: For more information on epsilon, please see the function math_set_epsilon().
zh_cn: 有关epsilon的更多信息，请参阅函数math_set_epsilon()。

source: For more information on parents see the section on the Object Editor.
zh_cn: 有关父类的更多信息，请参阅对象编辑器一节。

source: For more information on scripts, see The Script Editor.
zh_cn: 有关脚本的更多信息，请参见脚本编辑器。

source: For more information on texture filtering, see the function gpu_set_texfilter().
zh_cn: 有关纹理过滤的更多信息，请参见函数gpu_set_texfilter()。

source: For more information on texture repeating, see the function gpu_set_texrepeat().
zh_cn: 有关纹理重复的更多信息，请参见函数gpu_set_texrepeat()。

source: For more information on window position and window size, see window_set_position() and window_set_size().
zh_cn: 有关窗口位置和窗口大小的更多信息，请参见window_set_position()和window_set_size()。

source: For more information see the section on Audio Listeners.
zh_cn: 有关更多信息，请参见音频一节。

source: For more information, please see the page on Sequence Events and Moments.
zh_cn: 欲了解更多信息，请参阅序列事件和时刻页面。

source: For more information, please see the section on Track Structs.
zh_cn: 有关更多信息，请参见跟踪结构一节。

source: For other devices it will return 0, and you should use the device_mouse_raw_x() and device_mouse_raw_y() functions instead.
zh_cn: 对于其他设备，它将返回0，您应该使用device_mouse_raw_x()和device_mouse_raw_y()函数。
